[
    {
      "id": 1,
      "title": "My plans. My ambition",
      "tag": "Entrepreneurship",
      "date": "03-08-25",
      "uploaded": false,
      "writing": "I created this website for two reasons. First, to serve as a blueprint for my plans and ambitions—so I can always be reminded of what line of action is next. And second, to have personal conversations with myself on topics I do not see enough people talking about—topics like how to bring about prosperity, and questioning things in our country that are obviously not working.\n\nNigeria is a very complex place to be honest. There is never just one obtsacle people with brilliant ideas like myself have to overcome. There are many problems like how do you access capital to fund your business idea? How do you succeed in a country with no infrastructural support from the government? How do you establish a sustainable business in a country where the people keep getting poor, or where the literacy level is low, or where the quality of the workforce, businesses, government agencies is abysmal?\n\nConsidering these obstacles, I’ve struggled with deciding where to start.\n\nI’ve decided, however, that the best place to start is with computer programming—learning and accumulating as much knowledge as I can on how to create useful and impactful software products.\n\nMy reason for this is simple. I strongly believe software development is one of the few industries that demands the least resources to get started—relative to other industries—but can also have a huge and pervasive impact.\n\nDespite my country’s complexities, there are certain factors we enjoy with the rest of the world that makes software the right starting point. First is the low barrier to entry to creating software. With the advent of AI and free online resources, learning how to code has never been easier. Second is the ubiquity of smartphones which means the potential users of your software is unimaginable—depending on its usefulness. And the last is impact—great software products easily travel the world faster than tangible products restrained by geography.\n\nWhen it comes to software development in Nigeria, I think we’re further behind than we like to admit. The so-called “Nigerian tech boom” between 2015 to 2021 led to the deception that we’re advancing technologically even though it’s just in software. Despite how significant this period was, everyone turned a blind eye to whether the country actually experienced any significant advancements.\n\nFor example, tech cuts across many industries and parts of human life, but the only industry that saw any level of advancement was the financial sector, and even in this sector nothing significant was accomplished beyond bank transfers that are still unreliable, online payments, and online saving and investing platforms for retail investors. I don’t think any of this is worthy of a phrase like the “Nigerian tech boom”.\n\nI’ve decided the place to start is to acknowledge our level of expertise in this field, accumulate as much knowledge as we can, make these knowledge accessible to Nigerians free of charge, and then build useful software tools to solve problems in the country. This should be treated as a crusade. As a mission.\n\nAfter software, the next step is hardware—getting involved in industrialization. We need to start building tangible things that can be used locally but also exported across the world. We should evaluate our comparative advantage and then execute accordingly. I’ve always been facinated with the integration of hardware and software, so our expertise in software development should be useful at this stage.\n\nOne major obstacle to industrialization, however, is the quality of our workforce. The spillover effect of this poor workforce over many years is that our people have no trust in products made in Nigeria. While this might seem unpatriotic, I think it’s justified. The solution to this is to make sure whatever we build is of great quality worthy of changing people’s mind.\n\nLike the software phase, this phase will also require deep learning and training because we just don’t have the capabilities with the current workforce.\n\nThe next phase will be to build infrastructures; houses, energy, roads, telecommunications. I don’t know if it’s right to put industrialization before infrastructures, but by this stage I’m operating from the status of a successful entrepreneur in software and hardware that now has the people and capital to fund such projects.\n\nAnd I also understand that such ambitions like building infrastructure is mostly left to governments, but with great success comes great liberty to do whatever you want.\n\nI understand my writing over-simplifies the execution of these ideas. It might even sound like the wish"
    },


    {
        "id": 2,
        "title": "Why I’m studying computer science",
        "tag": "Technology",
        "date": "03-08-25",
        "published": false,
        "writing": "When I bought my laptop, the first skills I learned were how to use Photoshop, Adobe Illustrator, and After Effects. My intention was to use these skills to build a business that would have a widespread impact—a business with ubiquitous services. But then I realized they weren’t tech skills. They were really just design skills. I don’t regret the time I spent learning them, though, because they come in handy when building things.\n\nThen I discovered programming—writing code. I realized programming skills are what I need if I’m going to build a high-impact business like, say, Google. The leverage is massive, and the barrier to entry is almost zero. So, I started learning how to program.\n\nThe deeper I got into programming—and as I watched interviews with different software engineers using terms I wasn’t familiar with—the more convinced I became that some of these people had a kind of knowledge that went beyond just writing code. It was computer science.\n\nI realized there are levels to being a software engineer. You can be someone who just knows how to write code and build things, or you can be a god-like engineer who not only writes code but also has a deep understanding of how computers work.\n\nThe more I thought about this, the more I saw how important computer science is to the world we live in today. Computers of all kinds are becoming more and more integrated into human life—our phones, AI, laptops, and beyond. If I’m going to be one of the people building things with real impact, then I need to study computer science.\n\nComputer science is the backbone of the innovations shaping our era. It’s the gateway to jobs that build the future. And if I’m going to be part of building that future, I need to study computer science."
    },

    {
        "id": 3,
        "title": "Nigerian Public Discourse by Babatunde Raji Fashola (BRF)",
        "tag": "Books",
        "date": "03-08-25",
        "published": false,
        "writing": "I regard this book as one of the most important books for Nigeria. I see it as a kind of holy book—pointing the way so we can make Nigeria what we want her to be.\n\nIt’s easy to disregard it because of its size and dismiss it as just another piece of text on the history and problems of Nigeria. But after reading it several times, I’ve come to realize that what it does is concisely explain how the Nigerian political system works, while also calling on us Nigerians to roll up our sleeves and contribute to the building of our country—which is the most important part.\n\nThe book made me realize that maybe Nigeria is not as bad as we think. Maybe the negative images we have of our country are exaggerated. That we, the citizens, are doing more harm than good by dragging her name through the mud. At the same time, the book doesn’t deny that we have a lot to fix.\n\nMost importantly, it lets us know there is hope for redemption—and that with the right mindset, intelligence, and strategies, we can make her the prosperous nation we want her to be.\n\nMatters like corruption and other problems plaguing our country are mentioned in the book. It would be very dishonest to turn a blind eye to these issues while clamouring for patriotism. But I chose to focus on the most important part: to stop humiliating our country and, more importantly, to roll up our sleeves and build her.\n\nIn the book, BRF talks about “the quest for a better life as an unending aspiration of human civilization.” Even if it's not to our satisfaction, Nigerians before us have played their part in getting us here. It is our turn."
    },

    {
        "id": 4,
        "title": "American Prometheus by Kai Bird and Martin Sherwin",
        "tag": "Books",
        "date": "03-08-25",
        "published": false,
        "writing": "## Verdict on the Book\n\nThis is one of the best books I’ve ever read. What I love the most is the abundance of information provided on every character you come across—both main and subordinate. This gives readers enough knowledge about each person and presents them as imperfect humans ahead of the terrible things you’ll read in later pages of the book.\n\nSome reviews complain that this abundant information makes the book superfluous, but I prefer it the way it is. It makes the book rich and interesting. I should also mention that the book is an emotional rollercoaster, oscillating between triumph and tragedy.\n\n## Oppie’s Privileged Childhood\n\nConsidering the childhood that Oppie had, I think people like him are set up to play the role he did in the world. Starting from having wealthy parents that gave him the best experiences, then being under the influence of a visionary like Felix Adler and attending his school, the Ethical Culture Society, then studying at the finest universities like the University of Göttingen—which was the Mecca for studying physics at the time—then having great people like Niels Bohr and Max Born as mentors. Putting all this together is like a universal force setting you up for success.\n\nThese life advantages, however, do not discredit his innate brilliance. Oppie was an extremely brilliant human.\n\n## His Involvement in Communism\n\nHis involvement in communism was the onus of all the problems he faced. While he was never an official member of the Communist Party, it is disturbing how deeply involved he was with communism. He donated to communist causes, fell deeply in love with an ardent communist, married an ex-communist, and had communist members as close friends. I should note that progressive ideologies and communism were the trend of his time. However, I don’t think following a trend is a worthy excuse for why he got so deeply involved in a cause he did not fully believe in. He was so entangled that no one could tell if he was a communist or not—not even some of his closest friends.\n\nThe problems communism caused in his life got me asking a more important question: Why do Americans hate communism so much? Why does identifying as a communist serve as a mark that can get you ostracized? I prefer capitalism, but I find this funny for a country that claims freedom to be its most important value.\n\n## Leadership at Los Alamos\n\nHis leadership of the Manhattan Project was my favorite part of the book because I learned a lot. His leadership style was very interesting; he was informal with his colleagues and made work fun. The part I liked the most was his preference for openness in the workplace—meaning there should be a free flow of information and collaboration among workers. This opposed what the military preferred, which was compartmentalization to prevent sensitive information from leaking to enemies.\n\nThe last time I came across this debate of openness vs. compartmentalization was when I was reading Steve Jobs’ biography. The biography explained Steve’s aim when spearheading the construction of the Pixar and Apple headquarters—how he wanted buildings that encouraged serendipity so workers could meet more often, share ideas, and hopefully build great things from there.\n\n## Building and Using the Atomic Bomb; Moral Reckoning\n\nThis is the most complicated part of the book. This is the part that starts the debate on the morality of building and using the atomic bomb. And there is also the moral debate on the justification of using the bomb on Japan despite their surrender. In my view, the foundation of all these moral debates is the question of “should technology be put on a leash,” and can we even control its advancement?\n\nMy answer is no. We should not put technology on a leash, and we can’t control its advancement. But we must regulate it. The evidence for this is in the race between the U.S. and Nazi Germany to build the atomic bomb. If the U.S. had not built the bomb while questioning its morality, then that would have given the Nazis enough time to build theirs. And if the bomb wasn’t dropped on Japan, then the world wouldn’t realize its magnitude and devastation.\n\nMy argument sounds cruel and immoral, but something I’ve learned is that in the world of geopolitics, morals don’t matter. Rather, what’s in the best interest of your country is what matters. A contemporary example of this is the race for AGI between the U.S. and China. Whoever gets AGI first—if that’s even possible—will be in a more powerful position. So does it really make sense to abandon the technology (AGI) or curtail its advancement due to “morality”?\n\n## His Activism for the Control of the Atomic Bomb\n\nThis part of the book is where Oppie developed enemies because of his opposing views, and also because he appeared too perfect. By this point he was world-famous, and people saw him as an authority on scientific matters. What caused his enemies, however, was his political naivety. He kept trying to push an agenda that almost every politician in Washington was against.\n\nHe was genuine about controlling the proliferation of nuclear weapons, but he chose to be an idealist instead of a realist. This is an American thing. They like being virtuous, like they can save the world—climate change, the genocide in Gaza, veganism, democracy, gender equality. It’s like they’re trying to atone for the sins of their government. So instead of being realists and seeing the world for what it is, they chase a utopia.\n\n## The 1954 Hearing\n\nThe 1954 hearing was when Oppie was hauled before a committee, then had his private, public, and professional life publicly examined to ascertain if he was a communist or not.\n\nThe buildup to this hearing revealed how much hatred some people had for him, and the lengths they went to in order to bring him down.\n\nThe most important thing it reveals is how dangerous politicians with unchecked power can be. They violated his privacy multiple times by constantly listening to his phone calls and having detectives follow him everywhere he went—even when it was no longer necessary.\n\nThe scary thing is these privacy violations still happen today, and they’re more extreme due to the prevalence of mobile phones and the internet. With this, it is much easier to ruin people’s lives compared to Oppie’s time. In this age, privacy is an illusion.\n\n## Lessons Learned\n\nI think Oppie was one of the most important figures of the 20th century because he was at the center of building a weapon that decisively brought WWII to an end and shaped the world we live in, in terms of warfare.\n\nThere are many things to learn from the book. Examples include how or what to do with the advent of a new technology, how to deal—or not deal—with politicians, and how vulnerable we all are to surveillance and privacy violations. I think the book is raw. It reveals how complex and dangerous we humans are towards each other, on both a global scale and an interpersonal level.\n\n## Post-Script\n\nOppie died at the age of 62 from throat cancer caused by consistent chain smoking. While he might have lived a short life, I think he lived it to the fullest.\n\nWhen someone cautioned him to stop smoking, he replied, “Let me live while I’m alive.”"
    },

    {
        "id": 5,
        "title": "Titan: The Life of John D. Rockefeller, Sr. by Ron Chernow",
        "tag": "Books",
        "date": "05-08-25",
        "published": false,
        "writing": "## My Verdict on the Book\n\nMy verdict on the book is not necessary to validate Ron Chernow’s brilliant writing. He is one of the finest writers I’ve come across, and his books on notable American figures of early 20th-century America are a gift to the world. This book is worth every minute.\n\nHumanity should be grateful for such a talent.\n\n---\n\n## What I Think of John D. Rockefeller, Sr.\n\nI think it’s impossible for a man like Rockefeller to lose in life. He was a monster—terrifyingly competent, focused, and disciplined. Humanity should be grateful he was religious, because I can’t imagine how ruthless he would have been without religion serving as a moral compass.\n\nRockefeller is a prime example of what happens when religion and ambition clash within an individual. The book shows the difficulty he faced in reconciling his religious consciousness with his unbridled ambition. To deal with this, he preferred to believe God had chosen him to accumulate as much wealth as he could—then distribute it for good.\n\nI think he simply enjoyed winning. He enjoyed the journey and the feeling of conquering his competition. You can see his demons creep out behind the mask once in a while—like when he uttered, “One day I will be the richest man in the world,” or when he threatened his competitors to sell to him or face hardship surviving in the industry.\n\nThere’s no doubt Rockefeller was corrupt. But his kind of corruption, I approve of. He couldn’t reconcile his corruption with his religion, which is why he did it from afar—letting his subordinates do the dirty work. I approve of his corruption because he was playing the game of entrepreneurship at a time when there were no rules and competition was cutthroat.\n\nMoreover, I don’t think he sought out corruption. Instead, he engineered it as a necessity to keep his business alive. The bribery, rebates, and anti-competitive practices were tactics developed to win. This is how entrepreneurship works: you use every advantage you have to win. Amazon does it. So do Apple and Google.\n\n---\n\n## On Co-operation vs Competition\n\nRockefeller was often seen as a thrifty businessman who was simply ruthless. Someone without taste or much reasoning. I disagree with that. This man was a brilliant businessman whose discipline and focus compensated for any intellectual deficiency people claim he had.\n\nMore than just being practical, Rockefeller believed in an ideology: cooperation over competition. He believed the early days of the oil industry were volatile. That the only way to ensure everyone wins was by bringing every oil company under a parent company, so the industry could be more efficient and profitable. He believed in this instead of unnecessary competition, where everyone was undercutting each other to win. It takes a great deal of intelligence to think and envision that. So Rockefeller was more than a thrifty businessman—he was a visionary.\n\n---\n\n## On His Religion and Philanthropy\n\nThe reason I approve of Rockefeller’s anti-competitive and corrupt practices is because they were necessary to bring order to a chaotic oil industry. Beyond this, I believe Rockefeller made up for the “evil” he did through his philanthropy. I don’t think I’ve read of any other man who gave more to the public than Rockefeller. The Rockefeller Foundation and other initiatives by him still exist to this day, doing good for the public. His philanthropy transcends him—not just through his foundations, but also through his descendants who use the money for good.\n\nNo one knows for sure how he or the oil industry would have fared if competition had won over cooperation. Would we have had more ultra-rich businessmen like Rockefeller donating even more to charity? I doubt that. What we do know is that one man won—and did a lot of good.\n\n---\n\n## On His Leadership\n\nI think Rockefeller’s leadership style was a direct reflection of his personality. He was a private and secretive person, skeptical of people’s intentions. This is why he encouraged his workers to be discreet with company operations, sat unnoticeably during meetings despite being the leader, and kept the same countenance whether he received good or bad news.\n\nSome of the things I learned from him: he trusted his own judgment, was meticulous, and let ideas marinate before deciding whether to execute. But once he decided to take action, he became unstoppable. Most importantly, he worked with equally competent people—the likes of Henry Flagler, John D. Archbold, and Frederick T. Gates.\n\n---\n\n## On Rockefeller Jr.\n\nMy favorite character in the book is Rockefeller Jr., because he succeeded at something most people fail at: being a competent and reliable heir.\n\nAs the first and only son, the responsibility of managing the family’s wealth rested on his shoulders. That responsibility had an adverse effect on him, evident in how he treated himself and his children. It would also be unfair not to acknowledge his competent wife, who served as his confidante.\n\nWhat impressed me most is that he knew his father had done questionable things, but he never confronted him. Instead, he quietly fixed the family name and steered clear of anything corrupt that might further damage their legacy.\n\nIf Rockefeller Sr. made the money, Jr. polished the family name.\n\n---\n\n## Does the End Justify the Means?\n\nOne important question the book raises is: *Does the end justify the means?* Some will say no—because there’s something called *objective morality*, where good is good and bad is bad.\n\nMy take is that life is more complicated than a simple yes or no can satisfy. There are a lot of gray areas. Was Rockefeller right to have accepted rebates that gave him an advantage over his competition? Yes. Anyone would’ve done the same. Was he right to have bribed politicians to protect his business? Yes. Anyone would’ve done the same. Was he right to have used anti-competitive tactics to get rid of competitors? I don’t know—but I would’ve done the same.\n\nCompetition—especially in entrepreneurship—is survival of the fittest. You either become the big fish that eats the smaller fish, or you get eaten by a bigger one.\n\nWhile I admit Rockefeller did questionable things to win, I believe he deserved everything he accumulated.\n\nCheers to one of the greatest entrepreneurs to have ever lived."
    }

]
